'''Напишите с использованием генератора списка'''

'''>>> res = []
>>> for x in [1, 2, 3]:
 for y in [100, 200, 300]:
 res.append(x + y)
>>> res
[101, 201, 301, 102, 202, 302, 103, 203, 303]'''

res = [x+y for x in [1,2,3] for y in [100,200,300]]
print(res)
